share/tutorials/incompressible/simple/pipe_cyclic/0.org/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 1;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            turbulentMixingLengthDissipationRateInlet;
    mixingLength    0.5;       // 0.5m - half channel height
    value           $internalField;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
  }
  walls
  {
    type            epsilonWallFunction;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
