share/tutorials/incompressible/simple/pipe_cyclic/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            turbulentIntensityKineticEnergyInlet;
    intensity       0.05;       // 5% turbulent intensity
    value           $internalField;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
  }
  walls
  {
    type            kqRWallFunction;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
