share/tutorials/incompressible/simple/pipe_cyclic/0.org/nuTilda
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            zeroGradient;
  }
  walls
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
