share/tutorials/incompressible/simple/pipe_cyclic/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      decomposeParDict;
}

numberOfSubdomains 5;
method          scotch;

// vim: set ft=foam et sw=2 ts=2 sts=2:
