share/tutorials/incompressible/simple/pipe_cyclic/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    smoother        GaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
    tolerance       1e-06;
    relTol          0.05;
  }
  pFinal
  {
    $p;
    tolerance       1e-06;
    relTol          0;
  }
  "(U|k|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
  "(U|k|epsilon)Final"
  {
    $U;
    tolerance       1e-05;
    relTol          0;
  }
}
PIMPLE
{
  nOuterCorrectors 4;
  nCorrectors     1;
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  residualControl
  {
    p               1e-2;
    U               1e-3;
    "(k|epsilon)"   1e-3;
  }
}
relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    U               0.7;
    k               0.7;
    "epsilon.*"     0.7;
  }
}
cache
{
  grad(U);
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
