share/tutorials/incompressible/simple/pipe_cyclic/system/topoSetDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      topoSetDict;
}

actions
(
  {
    name    f0;
    type    faceSet;
    action  new;
    source  patchToFace;
    sourceInfo
    {
      name "side1";
    }
  }
  {
    name    f0;
    type    faceSet;
    action  subset;
    source  boxToFace;
    sourceInfo
    {
      box (0 -100 -100)(100 -0.2 100);
    }
  }
  {
    name    c0;
    type    cellSet;
    action  new;
    source  faceToCell;
    sourceInfo
    {
      set     f0;
      option  any;
    }
  }
  {
    name    walls;
    type    faceSet;
    action  new;
    source  patchToFace;
    sourceInfo
    {
      name "walls";
    }
  }
  {
    name    c0;
    type    cellSet;
    action  delete;
    source  faceToCell;
    sourceInfo
    {
      set     walls;
      option  any;
    }
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
